Revit 2024 API
BuiltInFailures.SketchFailures.NoLoopsError Property
 Sketch is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoLoopsError { get; }
Visual Basic
Public Shared ReadOnly Property NoLoopsError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoLoopsError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace